students = ['Иванов', 'Петров', 'Сидоров', 'Васечкин', 'Ложкин', 'Смирнов', 'Орлов', 'Кузнецов', 'Михайлов', 'Соколов']

from random import randint as rand

print('╔═════════════════════════════╗')
print('║       Классный журнал       ║')
print('╟════════════════════╤════════╢')
print('║  Фамилия студента  │ Оценка ║')


for n in students:
    print('╟────────────────────┼────────╢')
    name = n + (18 - len(n)) * ' '
    print('║', name, '│  ', rand(2, 5), '   ║')


print('╚════════════════════╧════════╝')